#+STARTUP: showall
#+OPTIONS: toc:nil

* VERSION

#+BEGIN_SRC sh :exports results 
cat version
#+END_SRC

#+RESULTS:
: 0.2.0

* SYNOPSIS

#+BEGIN_SRC lisp :exports both :results output
(use-package :cl-change-case)

(format t "~{~S~%~}"
        (list (camel-case "test string")
              (param-case "test string")
              (pascal-case "test string")))
#+END_SRC

#+RESULTS:
: "testString"
: "test-string"
: "TestString"

*** lower-case

Return the string in lower case.

#+BEGIN_SRC lisp :exports both
(lower-case "TEST STRING")
#+END_SRC

#+RESULTS:
: test string

*** lower-case-first

Lower case of the first character of string.

#+BEGIN_SRC lisp :exports both
(lower-case-first "TEST STRING")
#+END_SRC

#+RESULTS:
: tEST STRING

*** upper-case

Return the string in upper case.

#+BEGIN_SRC lisp :exports both
(upper-case "test string")
#+END_SRC

#+RESULTS:
: TEST STRING

*** upper-case-first

Upper case the first character of string.

#+BEGIN_SRC lisp  :exports both
(upper-case-first "test string")
#+END_SRC

#+RESULTS:
: Test string

*** no-case

Make string a lower case, space separated string. 

#+BEGIN_SRC lisp :exports both
(no-case "test_stringTest")
#+END_SRC

#+RESULTS:
: test string test

Optionally you can provide a different replacement string.

#+BEGIN_SRC lisp :exports both
(no-case "test_stringTest" :replacement "$$")
#+END_SRC

#+RESULTS:
: test$$string$$test

*** dot-case

Convert string to =dot.case=.

#+BEGIN_SRC lisp :exports both
(dot-case "Test String")
#+END_SRC

#+RESULTS:
: test.string

*** sentence-case

Makes string a lower case, space separated string with the first word capitalized.

#+BEGIN_SRC lisp :exports both
(sentence-case "thisIsATestString")
#+END_SRC

#+RESULTS:
: This is a test string

*** title-case

Make string space separated with each word capitalized.

#+BEGIN_SRC lisp :exports both
(title-case "this_is a_test_string")
#+END_SRC

#+RESULTS:
: This Is A Test String

